# Prot_IsModuleEnabled

## Description
Returns true if the specified module is enabled.

```pascal
FUNCTION Prot_IsModuleEnabled(module : LONGINT) : BOOLEAN;
```

```python

def vs.Prot_IsModuleEnabled(module):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|module|LONGINT||

## Version
Availability: from Vectorworks 2023
## Category
* Protection